Revit 2024 API
ScheduleDefinition.SetSortGroupFields Method
 Replaces all sorting/grouping fields in this ScheduleDefinition.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public void SetSortGroupFields(
	IList<ScheduleSortGroupField> sortGroupFields
)
Visual Basic
Public Sub SetSortGroupFields ( _
	sortGroupFields As IList(Of ScheduleSortGroupField) _
)
Visual C++
public:
void SetSortGroupFields(
	IList<ScheduleSortGroupField^>^ sortGroupFields
)
Parameters
sortGroupFields
Type: System.Collections.Generic.IList<ScheduleSortGroupField>
 The new list of sorting/grouping fields.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The resulting sorting/grouping field count would be greater than 4. -or- A field ID is not the ID of a field in this ScheduleDefinition. -or- A field cannot be used for sorting/grouping.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace